config/core/completion/consult.org
#+title: Consult Configuration
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle consult.el
#+auto_tangle: y

* Introduction
This file configures Consult, which provides practical search and navigation commands.
It enhances many built-in Emacs commands with more powerful alternatives.

* Basic Configuration
Setup lexical binding and core Consult functionality.

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-

;; ===============================================================================
;; Configure Consult - Enhanced Search and Navigation
;; ===============================================================================

(use-package consult
  :straight (consult :host github :repo "minad/consult") ; later versions require emacs 29
  :bind (
   ("C-x b" . consult-buffer)
   ("C-s" . consult-line))
  :config
  ;; Only add perspective integration if it's loaded
  (with-eval-after-load 'perspective
    (when (boundp 'persp-consult-source)
      (add-to-list 'consult-buffer-sources persp-consult-source))))
#+end_src

* Project Integration
Add support for project-based operations with Consult.

#+begin_src emacs-lisp
;; Project integration for Consult
(use-package consult-projectile
  :straight (consult-projectile :type git :host gitlab :repo "OlMon/consult-projectile" :branch "master"))
#+end_src